export const appName = "极物聊天";
export const appEnName = "JiwuChat";
export const appTitle = `${appEnName} | ${appName} - 轻量、高效的即时通讯平台`;
export const appDescription = "极物聊天应用 - 一款集成聊天、群聊、AI助手、音视频通话、消息通知及跨平台支持的智能通信平台，支持用户管理、好友系统、模型切换、商城扩展等多种功能，全面满足个人与团队的社交与协作需求。";
export const appKeywords = "JiwuChat, 即时通讯, IM系统, 聊天平台, 群聊功能, AI聊天, 多模型AI, 视频通话, 语音通话, 好友管理, 消息同步, WebRTC, 消息推送, 多端适配, 跨平台通信, 用户管理, 系统通知, 智能助手, 翻译工具, 文件管理, 深色主题, 自适应布局, Kimi, DeepSeek, Gmini, 硅基流动AI";

export const appTerms = `
## 欢迎您使用极物聊天！

在您注册并使用极物聊天（以下简称“本软件”）之前，请您仔细阅读并充分理解本协议的全部内容，特别是免除或限制责任的条款、法律适用和争议解决条款。您点击“同意”或“注册”按钮，或实际使用本软件，即视为您已阅读并同意本协议的约束。

## 一、 协议范围

1.1 本协议是您与极物聊天之间关于您下载、安装、使用本软件，以及使用本软件相关服务所订立的协议。

1.2 本协议内容包括协议正文及所有极物聊天已经发布或将来可能发布的各类规则、公告、通知等（以下统称为“规则”）。所有规则为本协议不可分割的组成部分，与本协议正文具有同等法律效力。

## 二、 软件使用

2.1 您承诺使用本软件仅用于合法目的，并遵守所有适用的法律法规。

2.2 您不得利用本软件从事任何违反法律法规、社会公德或损害他人合法权益的行为，包括但不限于：

* 发布、传播含有下列内容的信息：
    * 反对宪法所确定的基本原则的；
    * 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
    * 损害国家荣誉和利益的；
    * 煽动民族仇恨、民族歧视，破坏民族团结的；
    * 破坏国家宗教政策，宣扬邪教和封建迷信的；
    * 散布谣言，扰乱社会秩序，破坏社会稳定的；
    * 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
    * 侮辱或者诽谤他人，侵害他人合法权益的；
    * 含有法律、行政法规禁止的其他内容的。
* 进行任何可能对互联网的正常运行造成不利影响的行为；
* 进行任何可能对极物聊天的正常服务造成不利影响的行为；
* 其他违反法律法规、社会公德或损害他人合法权益的行为。

2.3 您理解并同意，极物聊天有权依据法律法规、本协议以及极物聊天相关规则，对您使用本软件的行为进行监督和管理，并采取必要的措施，包括但不限于：

* 删除、屏蔽违规信息；
* 限制、暂停或终止您使用本软件的部分或全部功能；
* 注销您的账号；
* 追究您的法律责任。

## 三、 用户信息保护

3.1 极物聊天非常重视用户信息的保护，并将按照法律法规的要求，采取必要的措施保护您的个人信息安全。

3.2 您在使用本软件时，可能需要提供一些个人信息，例如您的手机号码、昵称、头像等。您应保证所提供的个人信息真实、准确、完整。

3.3 极物聊天承诺不会将您的个人信息用于任何未经您授权的用途，也不会将您的个人信息泄露给任何第三方，但以下情况除外：

* 法律法规规定的；
* 国家机关依法要求的；
* 为维护社会公共利益的；
* 为维护极物聊天或其他用户的合法权益的。

## 四、 免责声明

4.1 您理解并同意，本软件是按照“现状”和“现有”的基础提供的，极物聊天不对本软件提供任何形式的保证，包括但不限于对本软件的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途的保证。

4.2 您理解并同意，使用本软件可能存在风险，例如因网络原因、系统维护等原因造成的服务中断、数据丢失等，极物聊天不承担任何责任。

4.3 您理解并同意，极物聊天不保证本软件中由第三方提供的服务或内容的真实性、准确性、合法性，您应自行判断并承担所有风险。

## 五、 协议修改

5.1 极物聊天有权根据法律法规的变化、业务发展的需要等原因，对本协议进行修改，修改后的协议将在极物聊天官方网站或本软件上公布。

5.2 如果您不同意极物聊天对本协议所做的修改，您有权停止使用本软件。如果您继续使用本软件，则视为您接受修改后的协议。

## 六、 法律适用和争议解决

6.1 本协议的订立、执行和解释均适用中华人民共和国法律。

6.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向极物聊天所在地有管辖权的人民法院提起诉讼。

## 七、 其他

7.1 本协议自您点击“同意”或“注册”按钮，或实际使用本软件之日起生效。

7.2 本协议所有条款的标题仅为阅读方便，本身并无实际含义，不能作为本协议含义解释的依据。

7.3 本协议最终解释权归极物聊天所有。

## 感谢您使用极物聊天！

`;

export const githubReportUrl = "https://github.com/KiWi233333/JiwuChat";
export const giteeReportUrl = "https://gitee.com/KiWi233333/JiwuChat";
